Trotter73/esp8266-weather-clock-opensource/firmware/weather_clock/web_server.cpp
/*
 * web_server.cpp - Web server handlers
 * TJ-56-654 Weather Clock v1.9.3
 */

#include "globals.h"
#include <EEPROM.h>
#include <ESP8266mDNS.h>

// Dummy function for compatibility
void ICACHE_FLASH_ATTR displaySegments(const uint8_t segments[]) {
  // Not used with OLED
}

// PROGMEM templates for handleRoot()
const char ROOT_HTML_HEADER[] PROGMEM =
  "<!DOCTYPE html><html><head>"
  "<meta charset='UTF-8'>"
  "<meta name='viewport' content='width=device-width, initial-scale=1'>"
  "<title>TJ-56-654 Clock v" FIRMWARE_VERSION "</title>"
  "<style>"
  "body{font-family:Arial;margin:20px;background:#f0f0f0;}"
  ".container{max-width:600px;margin:0 auto;background:white;padding:20px;border-radius:10px;box-shadow:0 2px 10px rgba(0,0,0,0.1);}"
  "h1{color:#333;}.time{font-size:48px;text-align:center;margin:20px 0;font-weight:bold;color:#0066cc;}"
  ".info{margin:10px 0;padding:10px;background:#f9f9f9;border-radius:5px;}"
  ".error{background:#ffebee;color:#c62828;}"
  "a.button{display:inline-block;background:#0066cc;color:white;padding:10px 20px;text-decoration:none;border-radius:5px;margin:10px 5px;}"
  "a.button:hover{background:#0052a3;}"
  ".debug{background:#fff3cd;color:#856404;padding:10px;border-radius:5px;margin:10px 0;}"
  "</style>"
  "<script>"
  "function updateTime(){fetch('/api/time').then(r=>r.json()).then(d=>{document.getElementById('time').innerText=d.time;});}"
  "setInterval(updateTime,1000);updateTime();"
  "</script>"
  "</head><body>"
  "<div class='container'>"
  "<h1>TJ-56-654 NTP Clock v" FIRMWARE_VERSION "</h1>"
  "<div class='time' id='time'>--:--:--</div>";

const char ROOT_HTML_FOOTER[] PROGMEM =
  "<a href='/config' class='button'>Configuration</a>"
  "<a href='/debug' class='button'>Debug Info</a>"
  "<a href='/update' class='button'>Firmware Update</a>"
  "<a href='/api/status' class='button'>Status (JSON)</a>"
  "<button class='button' onclick=\"if(confirm('Reboot device?')) fetch('/api/reboot', {method:'POST'}).then(()=>alert('Rebooting...'))\">Reboot</button>"
  "</div></body></html>";

void ICACHE_FLASH_ATTR handleRoot() {
  char buf[150];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");

  server.sendContent_P(ROOT_HTML_HEADER);

  if (lastError != "") {
    snprintf_P(buf, sizeof(buf), PSTR("<div class='info error'><strong>Error:</strong> %s</div>"), lastError.c_str());
    server.sendContent(buf);
  }

  snprintf_P(buf, sizeof(buf), PSTR("<div class='info'><strong>WiFi:</strong> %s</div>"), WiFi.SSID().c_str());
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf), PSTR("<div class='info'><strong>IP:</strong> %s</div>"), WiFi.localIP().toString().c_str());
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf), PSTR("<div class='info'><strong>Hostname:</strong> %s.local</div>"), config.hostname);
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf), PSTR("<div class='info'><strong>Uptime:</strong> %lu seconds</div>"), millis()/1000);
  server.sendContent(buf);

  if (!timeClient.isTimeSet()) {
    snprintf_P(buf, sizeof(buf), PSTR("<div class='debug'><strong>NTP not synced yet</strong><br>Attempts: %d | Success: %d</div>"),
      ntpAttempts, ntpSuccesses);
    server.sendContent(buf);
  }

  server.sendContent_P(ROOT_HTML_FOOTER);
  server.sendContent("");
}

// PROGMEM templates for handleDebug()
const char DEBUG_HTML_HEADER[] PROGMEM =
  "<!DOCTYPE html><html><head>"
  "<meta charset='UTF-8'>"
  "<meta name='viewport' content='width=device-width, initial-scale=1'>"
  "<title>Debug Info</title>"
  "<style>"
  "body{font-family:monospace;margin:20px;background:#f0f0f0;}"
  ".container{max-width:800px;margin:0 auto;background:white;padding:20px;border-radius:10px;}"
  ".ok{color:green;}.fail{color:red;}"
  "pre{background:#f5f5f5;padding:10px;border-radius:5px;overflow-x:auto;}"
  "button{background:#0066cc;color:white;padding:10px 20px;border:none;border-radius:5px;cursor:pointer;margin:5px;}"
  "</style>"
  "</head><body>"
  "<div class='container'>"
  "<h1>Debug Information</h1>"
  "<h2>Network</h2><pre>";

const char DEBUG_HTML_FOOTER[] PROGMEM =
  "<h2>Actions</h2>"
  "<button onclick=\"location.href='/test-ntp'\">Test NTP Now</button>"
  "<button onclick=\"location.href='/test-display'\">Test Display (8888)</button>"
  "<button onclick=\"location.reload()\">Refresh</button>"
  "<button onclick=\"location.href='/api/config'\">Download Config (JSON)</button>"
  "<button onclick=\"if(confirm('Clear EEPROM and reboot?')) fetch('/api/eeprom-clear', {method:'POST'}).then(()=>alert('Rebooting...'))\">Clear EEPROM</button>"
  "<button onclick=\"location.href='/'\">Back</button>"
  "</div></body></html>";

void ICACHE_FLASH_ATTR handleDebug() {
  char buf[200];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");

  server.sendContent_P(DEBUG_HTML_HEADER);

  snprintf_P(buf, sizeof(buf), PSTR("SSID: %s\nIP: %s\nGateway: %s\nDNS: %s\nRSSI: %d dBm\nHostname: %s\n</pre>"),
    WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.gatewayIP().toString().c_str(),
    WiFi.dnsIP().toString().c_str(), WiFi.RSSI(), config.hostname);
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>Internet Connectivity</h2><pre>Status: "));
  server.sendContent_P(internetConnected ? PSTR("<span class='ok'>Connected</span>\n</pre>") : PSTR("<span class='fail'>Not connected</span>\n</pre>"));

  server.sendContent_P(PSTR("<h2>NTP</h2><pre>"));
  snprintf_P(buf, sizeof(buf), PSTR("Server: %s\nUpdate interval: %u seconds\nSynced: "), config.ntp_server, config.ntp_interval);
  server.sendContent(buf);
  server.sendContent_P(timeClient.isTimeSet() ? PSTR("<span class='ok'>Yes</span>\n") : PSTR("<span class='fail'>No</span>\n"));

  snprintf_P(buf, sizeof(buf), PSTR("UTC time: %s\n"), timeClient.getFormattedTime().c_str());
  server.sendContent(buf);

  if (timeClient.isTimeSet()) {
    unsigned long epochTime = timeClient.getEpochTime();
    unsigned long localTime = epochTime + getTotalOffset(epochTime);
    snprintf_P(buf, sizeof(buf), PSTR("Local time: %02d:%02d:%02d\n"), (int)((localTime/3600)%24), (int)((localTime/60)%60), (int)(localTime%60));
    server.sendContent(buf);
  }

  snprintf_P(buf, sizeof(buf), PSTR("Attempts: %d\nSuccesses: %d\nLast error: %s\n</pre>"), ntpAttempts, ntpSuccesses, lastError.c_str());
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>Timezone & DST</h2><pre>"));
  snprintf_P(buf, sizeof(buf), PSTR("Base offset: %.1f hours (%ld seconds)\nDST enabled: %s\n"),
    config.timezone_offset/3600.0, config.timezone_offset, config.dst_enabled ? "Yes" : "No");
  server.sendContent(buf);

  if (config.dst_enabled && timeClient.isTimeSet()) {
    unsigned long epochTime = timeClient.getEpochTime();
    bool inDST = isDST(epochTime);
    snprintf_P(buf, sizeof(buf), PSTR("DST active now: %s\nTotal offset: %.1f hours\n"),
      inDST ? "<span class='ok'>Yes (+1 hour)</span>" : "No", getTotalOffset(epochTime)/3600.0);
    server.sendContent(buf);
  }

