Trotter73/esp8266-weather-clock-opensource/firmware/weather_clock/web_server.cpp
  snprintf_P(buf, sizeof(buf), PSTR("Time format: %s\n</pre>"), config.hour_format_24 ? "24-hour" : "12-hour (AM/PM)");
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>Weather</h2><pre>"));
  snprintf_P(buf, sizeof(buf), PSTR("Enabled: %s\nValid data: %s\n"),
    config.weather_enabled ? "Yes" : "No",
    weather.valid ? "<span class='ok'>Yes</span>" : "<span class='fail'>No</span>");
  server.sendContent(buf);

  if (weather.valid) {
    snprintf_P(buf, sizeof(buf), PSTR("Temperature: %.1f C\nWeather code: %d\nWind speed: %.1f km/h\nLast update: %lu sec ago\n"),
      weather.temperature, weather.weathercode, weather.windspeed, (millis() - weather.lastUpdate)/1000);
    server.sendContent(buf);
  }

  snprintf_P(buf, sizeof(buf), PSTR("City: %s\nLocation: %.6f, %.6f\nUpdate interval: %u seconds\n</pre>"),
    config.city_name, config.latitude, config.longitude, config.weather_interval);
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>Sunrise/Sunset</h2><pre>"));
  snprintf_P(buf, sizeof(buf), PSTR("Enabled: %s\n"), config.show_sunrise_sunset ? "Yes" : "No");
  server.sendContent(buf);

  if (sunTimes.lastDay != -1) {
    snprintf_P(buf, sizeof(buf), PSTR("<span class='ok'>Data available</span>\nSunrise: %s (%d min)\nSunset: %s (%d min)\nLast update day: %d\n</pre>"),
      sunTimes.sunrise, sunTimes.sunriseMinutes, sunTimes.sunset, sunTimes.sunsetMinutes, sunTimes.lastDay);
  } else {
    snprintf_P(buf, sizeof(buf), PSTR("<span class='fail'>No data</span>\n</pre>"));
  }
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>Display</h2><pre>"));
  const char* modeStr = (displayMode == 0) ? " (Time)" : (displayMode == 1) ? " (Weather)" : " (Sun times)";
  snprintf_P(buf, sizeof(buf), PSTR("Current mode: %d%s\nRotation interval: %u seconds\nBrightness: %d (0-7)\nShow weather: %s\nShow sun times: %s\nNTP synced: %s\n</pre>"),
    displayMode, modeStr, config.display_rotation_sec, config.brightness,
    config.show_weather ? "Yes" : "No", config.show_sunrise_sunset ? "Yes" : "No",
    timeClient.isTimeSet() ? "<span class='ok'>Yes</span>" : "<span class='fail'>No</span>");
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2>System</h2><pre>"));
  snprintf_P(buf, sizeof(buf), PSTR("Uptime: %lu seconds\nFree heap: %u bytes\nChip ID: %X\nFlash size: %u bytes\nSDK version: %s\n</pre>"),
    millis()/1000, ESP.getFreeHeap(), ESP.getChipId(), ESP.getFlashChipSize(), ESP.getSdkVersion());
  server.sendContent(buf);

  server.sendContent_P(DEBUG_HTML_FOOTER);
  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleTestNTP() {
  testInternetConnectivity();
  updateNTPTime();

  server.sendHeader("Location", "/debug");
  server.send(303);
}

void ICACHE_FLASH_ATTR handleTestDisplay() {
  uint8_t data[] = {0xFF, 0xFF, 0xFF, 0xFF};
  displaySegments(data);
  delay(3000);

  server.sendHeader("Location", "/debug");
  server.send(303);
}

// PROGMEM templates for handleConfig()
const char CONFIG_HTML_HEADER[] PROGMEM =
  "<!DOCTYPE html><html><head>"
  "<meta charset='UTF-8'>"
  "<meta name='viewport' content='width=device-width, initial-scale=1'>"
  "<title>Configuration</title>"
  "<style>"
  "body{font-family:Arial;margin:20px;background:#f0f0f0;}"
  ".container{max-width:600px;margin:0 auto;background:white;padding:20px;border-radius:10px;box-shadow:0 2px 10px rgba(0,0,0,0.1);}"
  "input,select{width:100%;padding:8px;margin:5px 0 15px 0;border:1px solid #ddd;border-radius:4px;box-sizing:border-box;}"
  "button{background:#0066cc;color:white;padding:12px 20px;border:none;border-radius:5px;cursor:pointer;width:100%;}"
  "button:hover{background:#0052a3;}"
  "label{font-weight:bold;}"
  "</style>"
  "</head><body>"
  "<div class='container'>"
  "<h1>Configuration</h1>"
  "<form method='POST' action='/config'>";

const char CONFIG_HTML_FOOTER[] PROGMEM =
  "<button type='submit'>Save & Reboot</button>"
  "</form>"
  "<p><a href='/'>Back to Home</a></p>"
  "</div></body></html>";

void ICACHE_FLASH_ATTR handleConfig() {
  char buf[150];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");

  server.sendContent_P(CONFIG_HTML_HEADER);

  snprintf_P(buf, sizeof(buf), PSTR("<label>WiFi SSID:</label><input type='text' name='ssid' value='%s' required>"), config.ssid);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>WiFi Password:</label><input type='password' name='password' value='%s'>"), config.password);
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf), PSTR("<label>Timezone Offset (seconds):</label><input type='number' name='timezone' value='%ld'>"), config.timezone_offset);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>Brightness (0-7):</label><input type='number' name='brightness' min='0' max='7' value='%d'>"), config.brightness);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>Hostname:</label><input type='text' name='hostname' value='%s'>"), config.hostname);
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2 style='margin-top:20px;'>Weather Settings</h2>"));
  snprintf_P(buf, sizeof(buf), PSTR("<label>City Name:</label><input type='text' name='city_name' value='%s'>"), config.city_name);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>Latitude:</label><input type='number' step='0.000001' name='latitude' value='%.6f'>"), config.latitude);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>Longitude:</label><input type='number' step='0.000001' name='longitude' value='%.6f'>"), config.longitude);
  server.sendContent(buf);
  snprintf_P(buf, sizeof(buf), PSTR("<label>Weather Update Interval (seconds):</label><input type='number' name='weather_interval' value='%u'>"), config.weather_interval);
  server.sendContent(buf);

  server.sendContent_P(PSTR("<h2 style='margin-top:20px;'>Display Settings</h2>"));
  snprintf_P(buf, sizeof(buf), PSTR("<label>Screen Rotation Interval (seconds):</label><input type='number' name='display_rotation_sec' value='%u'>"), config.display_rotation_sec);
  server.sendContent(buf);

  server.sendContent_P(CONFIG_HTML_FOOTER);
  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleConfigSave() {
  if (server.hasArg("ssid")) {
    safeStringCopy(server.arg("ssid"), config.ssid, sizeof(config.ssid));
  }
  if (server.hasArg("password")) {
    safeStringCopy(server.arg("password"), config.password, sizeof(config.password));
  }
  if (server.hasArg("timezone")) {
    config.timezone_offset = server.arg("timezone").toInt();
  }
  if (server.hasArg("brightness")) {
    config.brightness = server.arg("brightness").toInt();
  }
  if (server.hasArg("hostname")) {
    safeStringCopy(server.arg("hostname"), config.hostname, sizeof(config.hostname));
  }
  if (server.hasArg("city_name")) {
    safeStringCopy(server.arg("city_name"), config.city_name, sizeof(config.city_name));
  }
  if (server.hasArg("latitude")) {
    config.latitude = server.arg("latitude").toFloat();
  }
  if (server.hasArg("longitude")) {
    config.longitude = server.arg("longitude").toFloat();
  }
  if (server.hasArg("weather_interval")) {
    config.weather_interval = server.arg("weather_interval").toInt();
  }
  if (server.hasArg("display_rotation_sec")) {
    config.display_rotation_sec = server.arg("display_rotation_sec").toInt();
  }
  if (server.hasArg("display_orientation")) {
    config.display_orientation = server.arg("display_orientation").toInt();
    display.setRotation(config.display_orientation);
  }

