Trotter73/esp8266-weather-clock-opensource/firmware/weather_clock/web_server.cpp
  saveConfig();

  String html = F("<!DOCTYPE html><html><head>");
  html += F("<meta charset='UTF-8'>");
  html += F("<meta http-equiv='refresh' content='5;url=/'>");
  html += F("<style>body{font-family:Arial;text-align:center;margin-top:50px;}</style>");
  html += F("</head><body>");
  html += F("<h1>Configuration Saved!</h1>");
  html += F("<p>Device will reboot in 5 seconds...</p>");
  html += F("</body></html>");

  server.send(200, "text/html", html);

  delay(1000);
  ESP.restart();
}

void ICACHE_FLASH_ATTR handleAPITime() {
  char buf[256];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/json", "");

  snprintf_P(buf, sizeof(buf),
    PSTR("{\"time\":\"%s\",\"hours\":%d,\"minutes\":%d,\"seconds\":%d,\"epoch\":%lu}"),
    timeClient.getFormattedTime().c_str(),
    timeClient.getHours(),
    timeClient.getMinutes(),
    timeClient.getSeconds(),
    timeClient.getEpochTime());
  server.sendContent(buf);

  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleAPIStatus() {
  char buf[256];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/json", "");

  snprintf_P(buf, sizeof(buf),
    PSTR("{\"wifi\":{\"ssid\":\"%s\",\"ip\":\"%s\",\"rssi\":%d,\"hostname\":\"%s\"},"),
    WiFi.SSID().c_str(),
    WiFi.localIP().toString().c_str(),
    WiFi.RSSI(),
    config.hostname);
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf),
    PSTR("\"time\":{\"current\":\"%s\",\"timezone_offset\":%ld,\"ntp_synced\":%s},"),
    timeClient.getFormattedTime().c_str(),
    config.timezone_offset,
    timeClient.isTimeSet() ? "true" : "false");
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf),
    PSTR("\"system\":{\"uptime\":%lu,\"free_heap\":%u,\"chip_id\":\"%x\"}}"),
    millis() / 1000,
    ESP.getFreeHeap(),
    ESP.getChipId());
  server.sendContent(buf);

  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleAPIDebug() {
  char buf[256];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/json", "");

  snprintf_P(buf, sizeof(buf),
    PSTR("{\"internet_connected\":%s,\"ntp_attempts\":%d,\"ntp_successes\":%d,\"last_error\":\"%s\",\"gateway\":\"%s\",\"dns\":\"%s\"}"),
    internetConnected ? "true" : "false",
    ntpAttempts,
    ntpSuccesses,
    lastError.c_str(),
    WiFi.gatewayIP().toString().c_str(),
    WiFi.dnsIP().toString().c_str());
  server.sendContent(buf);

  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleAPIWeather() {
  char buf[256];

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/json", "");

  snprintf_P(buf, sizeof(buf),
    PSTR("{\"enabled\":%s,\"valid\":%s,\"temperature\":%.1f,\"weathercode\":%d,\"windspeed\":%.1f,\"last_update\":%lu,"),
    config.weather_enabled ? "true" : "false",
    weather.valid ? "true" : "false",
    weather.temperature,
    weather.weathercode,
    weather.windspeed,
    weather.lastUpdate);
  server.sendContent(buf);

  snprintf_P(buf, sizeof(buf),
    PSTR("\"sunrise\":\"%s\",\"sunset\":\"%s\",\"sunrise_minutes\":%d,\"sunset_minutes\":%d}"),
    sunTimes.sunrise,
    sunTimes.sunset,
    sunTimes.sunriseMinutes,
    sunTimes.sunsetMinutes);
  server.sendContent(buf);

  server.sendContent("");
}

void ICACHE_FLASH_ATTR handleAPIConfigExport() {
  String json = "{";
  json += "\"firmware_version\":\"" FIRMWARE_VERSION "\",";
  json += "\"magic\":\"0x" + String(config.magic, HEX) + "\",";
  json += "\"ssid\":\"" + String(config.ssid) + "\",";
  json += "\"password\":\"" + String(config.password) + "\",";
  json += "\"timezone_offset\":" + String(config.timezone_offset) + ",";
  json += "\"dst_enabled\":" + String(config.dst_enabled ? "true" : "false") + ",";
  json += "\"brightness\":" + String(config.brightness) + ",";
  json += "\"ntp_server\":\"" + String(config.ntp_server) + "\",";
  json += "\"ntp_interval\":" + String(config.ntp_interval) + ",";
  json += "\"hour_format_24\":" + String(config.hour_format_24 ? "true" : "false") + ",";
  json += "\"hostname\":\"" + String(config.hostname) + "\",";
  json += "\"latitude\":" + String(config.latitude, 6) + ",";
  json += "\"longitude\":" + String(config.longitude, 6) + ",";
  json += "\"city_name\":\"" + String(config.city_name) + "\",";
  json += "\"weather_enabled\":" + String(config.weather_enabled ? "true" : "false") + ",";
  json += "\"weather_interval\":" + String(config.weather_interval) + ",";
  json += "\"display_rotation_sec\":" + String(config.display_rotation_sec) + ",";
  json += "\"show_weather\":" + String(config.show_weather ? "true" : "false") + ",";
  json += "\"show_sunrise_sunset\":" + String(config.show_sunrise_sunset ? "true" : "false");
  json += "}";

  server.sendHeader("Content-Disposition", "attachment; filename=clock-config.json");
  server.send(200, "application/json", json);
}

void ICACHE_FLASH_ATTR handleAPIConfigImport() {
  if (!server.hasArg("plain")) {
    server.send(400, "text/plain", "No config data received");
    return;
  }

  String body = server.arg("plain");
  Serial.println("Received config: " + body);

  // Parse various fields (simplified parsing)
  int pos;

  pos = body.indexOf("\"ssid\":\"");
  if (pos >= 0) {
    int start = pos + 8;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.ssid, sizeof(config.ssid));
    }
  }

  pos = body.indexOf("\"password\":\"");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.password, sizeof(config.password));
    }
  }

  pos = body.indexOf("\"timezone_offset\":");
  if (pos >= 0) {
    int start = pos + 18;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.timezone_offset = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"brightness\":");
  if (pos >= 0) {
    int start = pos + 13;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.brightness = body.substring(start, end).toInt();
    }
  }

  pos = body.indexOf("\"hostname\":\"");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.hostname, sizeof(config.hostname));
    }
  }

  pos = body.indexOf("\"city_name\":\"");
  if (pos >= 0) {
    int start = pos + 13;
    int end = body.indexOf("\"", start);
    if (end > start) {
      safeStringCopy(body.substring(start, end), config.city_name, sizeof(config.city_name));
    }
  }

  pos = body.indexOf("\"latitude\":");
  if (pos >= 0) {
    int start = pos + 11;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.latitude = body.substring(start, end).toFloat();
    }
  }

  pos = body.indexOf("\"longitude\":");
  if (pos >= 0) {
    int start = pos + 12;
    int end = body.indexOf(",", start);
    if (end < 0) end = body.indexOf("}", start);
    if (end > start) {
      config.longitude = body.substring(start, end).toFloat();
    }
  }

  config.magic = CONFIG_MAGIC;
  saveConfig();

